{
    "class_name": "Model",
    "keras_version": "2.3.0",
    "config": {
        "name": "model_2",
        "layers": [
            {
                "name": "input_3",
                "class_name": "InputLayer",
                "config": {
                    "name": "input_3",
                    "sparse": false,
                    "batch_input_shape": [
                        null,
                        68
                    ],
                    "dtype": "float32"
                },
                "inbound_nodes": []
            },
            {
                "name": "input_4",
                "class_name": "InputLayer",
                "config": {
                    "name": "input_4",
                    "sparse": false,
                    "batch_input_shape": [
                        null,
                        4
                    ],
                    "dtype": "float32"
                },
                "inbound_nodes": []
            },
            {
                "name": "sequential_1",
                "class_name": "Sequential",
                "config": {
                    "name": "sequential_1",
                    "layers": [
                        {
                            "class_name": "Embedding",
                            "config": {
                                "input_dim": 22,
                                "input_length": null,
                                "embeddings_initializer": {
                                    "class_name": "RandomUniform",
                                    "config": {
                                        "minval": -0.05,
                                        "seed": null,
                                        "maxval": 0.05
                                    }
                                },
                                "activity_regularizer": null,
                                "dtype": "float32",
                                "batch_input_shape": [
                                    null,
                                    null
                                ],
                                "mask_zero": false,
                                "name": "embedding_3",
                                "trainable": true,
                                "embeddings_constraint": null,
                                "embeddings_regularizer": null,
                                "output_dim": 64
                            }
                        },
                        {
                            "class_name": "Dropout",
                            "config": {
                                "seed": null,
                                "rate": 0.3,
                                "name": "dropout_1",
                                "noise_shape": null,
                                "trainable": true,
                                "dtype": "float32"
                            }
                        }
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "input_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "sequential_3",
                "class_name": "Sequential",
                "config": {
                    "name": "sequential_3",
                    "layers": [
                        {
                            "class_name": "Embedding",
                            "config": {
                                "input_dim": 22,
                                "input_length": 4,
                                "embeddings_initializer": {
                                    "class_name": "RandomUniform",
                                    "config": {
                                        "minval": -0.05,
                                        "seed": null,
                                        "maxval": 0.05
                                    }
                                },
                                "activity_regularizer": null,
                                "dtype": "float32",
                                "batch_input_shape": [
                                    null,
                                    4
                                ],
                                "mask_zero": false,
                                "name": "embedding_5",
                                "trainable": true,
                                "embeddings_constraint": null,
                                "embeddings_regularizer": null,
                                "output_dim": 64
                            }
                        },
                        {
                            "class_name": "Dropout",
                            "config": {
                                "seed": null,
                                "rate": 0.3,
                                "name": "dropout_3",
                                "noise_shape": null,
                                "trainable": true,
                                "dtype": "float32"
                            }
                        }
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "input_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dot_1",
                "class_name": "Dot",
                "config": {
                    "name": "dot_1",
                    "trainable": true,
                    "normalize": false,
                    "axes": [
                        2,
                        2
                    ],
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "sequential_1",
                            1,
                            0,
                            {}
                        ],
                        [
                            "sequential_3",
                            1,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_1",
                "class_name": "Activation",
                "config": {
                    "name": "activation_1",
                    "trainable": true,
                    "activation": "softmax",
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "dot_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "sequential_2",
                "class_name": "Sequential",
                "config": {
                    "name": "sequential_2",
                    "layers": [
                        {
                            "class_name": "Embedding",
                            "config": {
                                "input_dim": 22,
                                "input_length": null,
                                "embeddings_initializer": {
                                    "class_name": "RandomUniform",
                                    "config": {
                                        "minval": -0.05,
                                        "seed": null,
                                        "maxval": 0.05
                                    }
                                },
                                "activity_regularizer": null,
                                "dtype": "float32",
                                "batch_input_shape": [
                                    null,
                                    null
                                ],
                                "mask_zero": false,
                                "name": "embedding_4",
                                "trainable": true,
                                "embeddings_constraint": null,
                                "embeddings_regularizer": null,
                                "output_dim": 4
                            }
                        },
                        {
                            "class_name": "Dropout",
                            "config": {
                                "seed": null,
                                "rate": 0.3,
                                "name": "dropout_2",
                                "noise_shape": null,
                                "trainable": true,
                                "dtype": "float32"
                            }
                        }
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "input_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "add_1",
                "class_name": "Add",
                "config": {
                    "name": "add_1",
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "sequential_2",
                            1,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "permute_1",
                "class_name": "Permute",
                "config": {
                    "name": "permute_1",
                    "dims": [
                        2,
                        1
                    ],
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "add_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_2",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_2",
                    "trainable": true,
                    "axis": -1,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "permute_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "sequential_3",
                            1,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lstm_3",
                "class_name": "LSTM",
                "config": {
                    "recurrent_constraint": null,
                    "unit_forget_bias": true,
                    "units": 32,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "recurrent_regularizer": null,
                    "implementation": 2,
                    "stateful": false,
                    "bias_regularizer": null,
                    "unroll": false,
                    "dtype": "float32",
                    "name": "lstm_3",
                    "trainable": true,
                    "go_backwards": false,
                    "kernel_constraint": null,
                    "use_bias": true,
                    "return_state": false,
                    "recurrent_activation": "sigmoid",
                    "activity_regularizer": null,
                    "dropout": 0.0,
                    "bias_constraint": null,
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "seed": null,
                            "gain": 1.0
                        }
                    },
                    "activation": "tanh",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "recurrent_dropout": 0.0,
                    "return_sequences": false
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dropout_4",
                "class_name": "Dropout",
                "config": {
                    "seed": null,
                    "rate": 0.3,
                    "name": "dropout_4",
                    "noise_shape": null,
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "lstm_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_2",
                "class_name": "Dense",
                "config": {
                    "units": 22,
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_regularizer": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "dtype": "float32",
                    "bias_regularizer": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "seed": null
                        }
                    },
                    "name": "dense_2",
                    "trainable": true,
                    "kernel_constraint": null,
                    "activation": "linear",
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_2",
                "class_name": "Activation",
                "config": {
                    "name": "activation_2",
                    "trainable": true,
                    "activation": "softmax",
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "output_layers": [
            [
                "activation_2",
                0,
                0
            ]
        ],
        "input_layers": [
            [
                "input_3",
                0,
                0
            ],
            [
                "input_4",
                0,
                0
            ]
        ]
    },
    "backend": "tensorflow"
}