{
    "backend": "tensorflow",
    "class_name": "RedShiftClassificationModel",
    "config": {
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        64,
                        64,
                        5
                    ],
                    "dtype": "float32",
                    "name": "input_1",
                    "sparse": false
                },
                "name": "input_1",
                "inbound_nodes": []
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_1",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        5,
                        5
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_1",
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "AveragePooling2D",
                "config": {
                    "trainable": true,
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "average_pooling2d_1",
                    "strides": [
                        2,
                        2
                    ],
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "same"
                },
                "name": "average_pooling2d_1",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_2",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 48,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_2",
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_3",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 48,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_3",
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_4",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 48,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_4",
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_5",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_5",
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_6",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        3,
                        3
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_6",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_7",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        5,
                        5
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_7",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "AveragePooling2D",
                "config": {
                    "trainable": true,
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "average_pooling2d_2",
                    "strides": [
                        1,
                        1
                    ],
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "same"
                },
                "name": "average_pooling2d_2",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "trainable": true,
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_1"
                },
                "name": "concatenate_1",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_5",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_6",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_7",
                            0,
                            0,
                            {}
                        ],
                        [
                            "average_pooling2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_8",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_8",
                "inbound_nodes": [
                    [
                        [
                            "concatenate_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_9",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_9",
                "inbound_nodes": [
                    [
                        [
                            "concatenate_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_10",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_10",
                "inbound_nodes": [
                    [
                        [
                            "concatenate_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_11",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 92,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_11",
                "inbound_nodes": [
                    [
                        [
                            "concatenate_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_12",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 92,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        3,
                        3
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_12",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_13",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 92,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        5,
                        5
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_13",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "AveragePooling2D",
                "config": {
                    "trainable": true,
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "average_pooling2d_3",
                    "strides": [
                        1,
                        1
                    ],
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "same"
                },
                "name": "average_pooling2d_3",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "trainable": true,
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_2"
                },
                "name": "concatenate_2",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_11",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_12",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_13",
                            0,
                            0,
                            {}
                        ],
                        [
                            "average_pooling2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "AveragePooling2D",
                "config": {
                    "trainable": true,
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "average_pooling2d_4",
                    "strides": [
                        2,
                        2
                    ],
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "same"
                },
                "name": "average_pooling2d_4",
                "inbound_nodes": [
                    [
                        [
                            "concatenate_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_14",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 92,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_14",
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_15",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 92,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_15",
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_16",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 92,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_16",
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_17",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 128,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_17",
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_18",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 128,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        3,
                        3
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_18",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_14",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_19",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 128,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        5,
                        5
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_19",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_15",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "AveragePooling2D",
                "config": {
                    "trainable": true,
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "average_pooling2d_5",
                    "strides": [
                        1,
                        1
                    ],
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "same"
                },
                "name": "average_pooling2d_5",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_16",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "trainable": true,
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_3"
                },
                "name": "concatenate_3",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_17",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_18",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_19",
                            0,
                            0,
                            {}
                        ],
                        [
                            "average_pooling2d_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_20",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 92,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_20",
                "inbound_nodes": [
                    [
                        [
                            "concatenate_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_21",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 92,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_21",
                "inbound_nodes": [
                    [
                        [
                            "concatenate_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_22",
                    "strides": [
                        1,
                        1
                    ],
                    "filters": 92,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "use_bias": true,
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "seed": null,
                            "distribution": "uniform",
                            "scale": 1.0,
                            "mode": "fan_avg"
                        }
                    },
                    "activation": "relu",
                    "kernel_size": [
                        1,
                        1
                    ],
                    "activity_regularizer": null,
                    "padding": "same"
                },
                "name": "conv2d_22",
                "inbound_nodes": [
                    [
                        [
                            "concatenate_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "data_format": "channels_last",
                    "name": "conv2d_23",
                    "strides": [
