{
    "class_name": "SequentialSubClass",
    "keras_version": "2.3.0",
    "config": {
        "name": "sequentialsubclass_1",
        "layers": [
            {
                "class_name": "Dense",
                "config": {
                    "units": 32,
                    "bias_constraint": {
                        "class_name": "MinMaxNorm",
                        "config": {
                            "min_value": -1,
                            "max_value": 1,
                            "rate": 1.0,
                            "axis": 0
                        }
                    },
                    "activity_regularizer": null,
                    "kernel_regularizer": null,
                    "bias_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "normal",
                            "mode": "fan_avg",
                            "seed": 33
                        }
                    },
                    "dtype": "float32",
                    "bias_regularizer": null,
                    "batch_input_shape": [
                        null,
                        32
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "seed": 46
                        }
                    },
                    "name": "dense_6",
                    "trainable": true,
                    "kernel_constraint": {
                        "class_name": "MaxNorm",
                        "config": {
                            "max_value": 1.5,
                            "axis": 0
                        }
                    },
                    "activation": "linear",
                    "use_bias": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 32,
                    "bias_constraint": {
                        "class_name": "MinMaxNorm",
                        "config": {
                            "min_value": -1,
                            "max_value": 1,
                            "rate": 1.0,
                            "axis": 0
                        }
                    },
                    "activity_regularizer": null,
                    "kernel_regularizer": null,
                    "bias_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "normal",
                            "mode": "fan_avg",
                            "seed": 33
                        }
                    },
                    "dtype": "float32",
                    "bias_regularizer": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "seed": 46
                        }
                    },
                    "name": "dense_7",
                    "trainable": true,
                    "kernel_constraint": {
                        "class_name": "MaxNorm",
                        "config": {
                            "max_value": 1.5,
                            "axis": 0
                        }
                    },
                    "activation": "tanh",
                    "use_bias": true
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "seed": null,
                    "rate": 0.5,
                    "name": "dropout_5",
                    "noise_shape": null,
                    "trainable": true,
                    "dtype": "float32"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 10,
                    "bias_constraint": {
                        "class_name": "MinMaxNorm",
                        "config": {
                            "min_value": -1,
                            "max_value": 1,
                            "rate": 1.0,
                            "axis": 0
                        }
                    },
                    "activity_regularizer": null,
                    "kernel_regularizer": null,
                    "bias_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "normal",
                            "mode": "fan_avg",
                            "seed": 33
                        }
                    },
                    "dtype": "float32",
                    "bias_regularizer": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "seed": 46
                        }
                    },
                    "name": "dense_8",
                    "trainable": true,
                    "kernel_constraint": {
                        "class_name": "MaxNorm",
                        "config": {
                            "max_value": 1.5,
                            "axis": 0
                        }
                    },
                    "activation": "softmax",
                    "use_bias": true
                }
            }
        ]
    },
    "backend": "tensorflow"
}